Revit 2027 API
StructuralWallUsageFilter Properties
The StructuralWallUsageFilter type exposes the following members.
Properties
Name | Description
Inverted |  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
(Inherited from ElementFilter)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ElementFilter)
StructuralWallUsage |  The wall structural usage.
Top
See Also
Reference
StructuralWallUsageFilter Class
Autodesk.Revit.DB.Structure Namespace